Tekla Open API Reference for Tekla Structures 2025
ReferenceText Methods
The WeldFilterExpressions.ReferenceText type exposes the following members.
Methods
Name | Description
ToString
 Creates a string representation of the current object.
 (Inherited from DataFilterExpression.)
Top
See Also
Reference
WeldFilterExpressions.ReferenceText Class
Tekla.Structures.Filtering.Categories Namespace